import React from "react";
import './Agreement.css';
import './../../../../styles/defaultDesign.css';

function TermsOfUse(){
  return (
    <div className="TermsOfUse--wrapper">
      <div className="TermsOfUse--container">
        <span className="Privacy--title">시행일 : 2024년 7월 5일</span>

        <div className="TermsOfUse--content">
          <span className="Privacy--title">계약</span>
          <span className="b6-16-m">
            1.1 GVZIP 서비스를 이용하려면 이러한 모든 약관에 동의해야 합니다. 이 약관(계약 또는 이용약관으로 부름)에 동의하지 않는 경우, 가입하기 등 GVZIP 서비스에 접속하거나 서비스를 이용할 수 없습니다. 이 계약을 종료하고 싶을 경우, 언제든지 계정을 폐쇄하고 GVZIP 서비스 접속 또는 사용을 중단하면 됩니다. 
            <br />
            <br />
            1.2 회원과 방문자
            GVZIP 서비스에 가입하면 회원이 됩니다. GVZIP 서비스에 가입하지 않을 경우 방문자로서 Home Page를 둘러볼 수 있습니다.
            <br />
            <br />
            1.3 개정
            GVZIP은 필요에 따라 이 문서, 개인정보 처리방침을 개정합니다. 내용이 개정될 경우, 이를 GVZIP 서비스 등을 통해서 법적고지하여 회원들이 개정 사항이 시행되기 전에 개정 사항을 검토할 수 있도록 할 것입니다. GVZIP은 해당 개정 사항이 소급 적용되지 않음에 동의합니다. 개정 사항에 반대할 경우 계정을 폐쇄하시기 바랍니다. 약관 개정에 대한 고지가 게시 또는 발송된 후에도 사용자가 계속해서 GVZIP 서비스를 사용하는 경우, 사용자가 시행일부터 개정된 약관에 동의함을 의미합니다.
          </span>
        </div>

        <div className="TermsOfUse--content">
          <span className="Privacy--title">의무</span>

          <span className="b6-16-m">
            2.1 서비스 적격성
            다음은 사용자의 의무입니다. 이 약관의 대상이 되려면 사용자는 GVZIP이 정한 최소 연령보다 높아야 합니다. 사용자는 비밀번호에 대한 기밀을 유지합니다. 본인이 아닌 다른 사람과 계정을 공유하지 않고, GVZIP의  규정과 법을 따라야 합니다. 사용자는 약속된 보안의 의무 안에서 정보를 저장할 것에 동의해야 합니다. 사용자는 GVZIP 웹사이트를 통해서 공지사항을 받는 데 동의합니다. 연락처 정보가 최신 정보가 아닌 경우 이러한 공지사항을 받지 못하게 될 수 있습니다. 사용자가 GVZIP 서비스에서 정보를 공유할 경우 다른 사람들도 해당 정보를 조회, 복사, 사용할 수 있습니다.
            14세 미만은 본 서비스를 사용할 수 없습니다.
            서비스를 사용하려면 사용자는 (1) 위에 명시된 최소 연령보다 높아야 하고, (2) GVZIP 계정을 1개만 보유해야 하며, 반드시 실명을 사용해야 하고, (3) GVZIP 서비스 이용을 사용할 수 없도록 차단된 적이 없어야 합니다. 다른 사람이나 14세 미만의 미성년자를 대신해 등록된 계정 등 허위 정보를 이용해 계정을 만드는 것은 약관에 위배되는 행위입니다.
            최소 연령은 14세입니다. 그러나 부모의 동의 없이 합법적으로 GVZIP 서비스를 제공 받기 위해서 특정 연령이 되어야 할 경우, 해당 연령이 최소 연령이 됩니다.
            <br />
            <br />
            2.2 계정
            회원이란 계정을 보유한 사람입니다. 사용자는 (1) 강력한 비밀번호를 사용하고 비밀로 유지하며, (2) 계정 정보를 일절 양도하지 않으며 (3) 법과 GVZIP 준수사항 및 금지사항을 따라야 합니다. 사용자는 사용자의 계정을 해지하거나 타인이 사용했다고 신고하지 않는 한, 사용자의 계정을 통해 발생하는 모든 일에 책임을 집니다.
            <br />
            <br />
            2.3 공지 및 메일
            사용자는 GVZIP의 공지사항 및 메일이 (1) 서비스 내에서 또는 (2) 회원이 입력한 연락처(이메일, 전화번호 등)로 제공된다는 점에 동의합니다. 사용자는 본인의 연락처를 최신 정보로 유지할 것에 동의합니다.
            주요 용어
            최소 연령
            최소 연령 미만인 회원은 서비스를 계속 사용할 수 없습니다.
          </span>
        </div>

        
      </div>
    </div>
  )
}

export default TermsOfUse;